rule hol_10_multi_event_correlation_adv_02 {
  meta:
	  author = "Raju"
    description = ""
    severity = "Medium"

  events:
    $e1.metadata.event_type="NETWORK_DNS"
    $e1.network.dns.questions.name=$url
    $e1.principal.ip = $ip

    $e2.metadata.event_type="NETWORK_HTTP"
    $e2.principal.ip = $ip
    $e2.target.hostname=$url

  match:
    $ip, $url over 5m after $e1

  condition:
    $e1 and !$e2
}
